fixed node commit
